; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=95, out_folder=htg/blocksworld/training, instance_id=75, seed=2099

(define (problem blocksworld-75)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 - object)
 (:init 
    (arm-empty)
    (clear b47)
    (on b47 b40)
    (on b40 b18)
    (on b18 b72)
    (on-table b72)
    (clear b11)
    (on b11 b42)
    (on b42 b71)
    (on b71 b90)
    (on b90 b80)
    (on b80 b41)
    (on b41 b83)
    (on b83 b87)
    (on b87 b27)
    (on b27 b70)
    (on b70 b43)
    (on b43 b88)
    (on b88 b67)
    (on b67 b44)
    (on b44 b21)
    (on-table b21)
    (clear b50)
    (on b50 b24)
    (on b24 b37)
    (on b37 b38)
    (on b38 b39)
    (on b39 b89)
    (on b89 b59)
    (on b59 b10)
    (on b10 b29)
    (on b29 b1)
    (on b1 b53)
    (on-table b53)
    (clear b23)
    (on-table b23)
    (clear b34)
    (on b34 b75)
    (on b75 b66)
    (on b66 b63)
    (on b63 b9)
    (on b9 b64)
    (on b64 b60)
    (on b60 b13)
    (on b13 b95)
    (on b95 b33)
    (on b33 b15)
    (on b15 b14)
    (on b14 b48)
    (on b48 b93)
    (on b93 b78)
    (on b78 b17)
    (on b17 b19)
    (on b19 b22)
    (on b22 b84)
    (on b84 b25)
    (on-table b25)
    (clear b58)
    (on b58 b35)
    (on b35 b57)
    (on b57 b69)
    (on b69 b74)
    (on b74 b73)
    (on b73 b8)
    (on b8 b4)
    (on-table b4)
    (clear b30)
    (on b30 b49)
    (on b49 b5)
    (on-table b5)
    (clear b45)
    (on b45 b31)
    (on-table b31)
    (clear b20)
    (on b20 b61)
    (on b61 b51)
    (on b51 b3)
    (on b3 b62)
    (on b62 b81)
    (on-table b81)
    (clear b46)
    (on-table b46)
    (clear b86)
    (on b86 b12)
    (on b12 b77)
    (on b77 b65)
    (on b65 b79)
    (on b79 b82)
    (on b82 b85)
    (on b85 b54)
    (on-table b54)
    (clear b6)
    (on b6 b56)
    (on b56 b94)
    (on b94 b76)
    (on-table b76)
    (clear b28)
    (on b28 b68)
    (on b68 b92)
    (on b92 b32)
    (on-table b32)
    (clear b2)
    (on b2 b7)
    (on b7 b16)
    (on b16 b36)
    (on b36 b52)
    (on b52 b26)
    (on b26 b91)
    (on-table b91)
    (clear b55)
    (on-table b55))
 (:goal  (and 
    (clear b8)
    (on b8 b4)
    (on b4 b7)
    (on b7 b9)
    (on b9 b1)
    (on-table b1)
    (clear b3)
    (on b3 b6)
    (on b6 b5)
    (on b5 b2)
    (on-table b2))))

; plan
1. (unstack b2 b7)
   deleted: (on b2 b7) (clear b2) (arm-empty)
   added: (holding b2) (clear b7)
   goals met: 1 of 11
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 11
3. (unstack b30 b49)
   deleted: (on b30 b49) (clear b30) (arm-empty)
   added: (holding b30) (clear b49)
   goals met: 2 of 11
4. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 11
5. (unstack b49 b5)
   deleted: (on b49 b5) (clear b49) (arm-empty)
   added: (holding b49) (clear b5)
   goals met: 2 of 11
6. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 2 of 11
7. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 2 of 11
8. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 3 of 11
9. (unstack b6 b56)
   deleted: (on b6 b56) (clear b6) (arm-empty)
   added: (holding b6) (clear b56)
   goals met: 3 of 11
10. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 4 of 11
11. (unstack b20 b61)
   deleted: (on b20 b61) (clear b20) (arm-empty)
   added: (holding b20) (clear b61)
   goals met: 4 of 11
12. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 11
13. (unstack b61 b51)
   deleted: (on b61 b51) (clear b61) (arm-empty)
   added: (holding b61) (clear b51)
   goals met: 4 of 11
14. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 4 of 11
15. (unstack b51 b3)
   deleted: (on b51 b3) (clear b51) (arm-empty)
   added: (holding b51) (clear b3)
   goals met: 5 of 11
16. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 5 of 11
17. (unstack b3 b62)
   deleted: (on b3 b62) (clear b3) (arm-empty)
   added: (holding b3) (clear b62)
   goals met: 4 of 11
18. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 6 of 11
19. (unstack b34 b75)
   deleted: (on b34 b75) (clear b34) (arm-empty)
   added: (holding b34) (clear b75)
   goals met: 6 of 11
20. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 6 of 11
21. (unstack b75 b66)
   deleted: (on b75 b66) (clear b75) (arm-empty)
   added: (holding b75) (clear b66)
   goals met: 6 of 11
22. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 6 of 11
23. (unstack b66 b63)
   deleted: (on b66 b63) (clear b66) (arm-empty)
   added: (holding b66) (clear b63)
   goals met: 6 of 11
24. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 6 of 11
25. (unstack b63 b9)
   deleted: (on b63 b9) (clear b63) (arm-empty)
   added: (holding b63) (clear b9)
   goals met: 6 of 11
26. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 6 of 11
27. (unstack b7 b16)
   deleted: (on b7 b16) (clear b7) (arm-empty)
   added: (holding b7) (clear b16)
   goals met: 6 of 11
28. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 7 of 11
29. (unstack b58 b35)
   deleted: (on b58 b35) (clear b58) (arm-empty)
   added: (holding b58) (clear b35)
   goals met: 7 of 11
30. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 7 of 11
31. (unstack b35 b57)
   deleted: (on b35 b57) (clear b35) (arm-empty)
   added: (holding b35) (clear b57)
   goals met: 7 of 11
32. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 7 of 11
33. (unstack b57 b69)
   deleted: (on b57 b69) (clear b57) (arm-empty)
   added: (holding b57) (clear b69)
   goals met: 7 of 11
34. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 7 of 11
35. (unstack b69 b74)
   deleted: (on b69 b74) (clear b69) (arm-empty)
   added: (holding b69) (clear b74)
   goals met: 7 of 11
36. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 7 of 11
37. (unstack b74 b73)
   deleted: (on b74 b73) (clear b74) (arm-empty)
   added: (holding b74) (clear b73)
   goals met: 7 of 11
38. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 7 of 11
39. (unstack b73 b8)
   deleted: (on b73 b8) (clear b73) (arm-empty)
   added: (holding b73) (clear b8)
   goals met: 8 of 11
40. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 8 of 11
41. (unstack b50 b24)
   deleted: (on b50 b24) (clear b50) (arm-empty)
   added: (holding b50) (clear b24)
   goals met: 8 of 11
42. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 8 of 11
43. (unstack b24 b37)
   deleted: (on b24 b37) (clear b24) (arm-empty)
   added: (holding b24) (clear b37)
   goals met: 8 of 11
44. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 8 of 11
45. (unstack b37 b38)
   deleted: (on b37 b38) (clear b37) (arm-empty)
   added: (holding b37) (clear b38)
   goals met: 8 of 11
46. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 8 of 11
47. (unstack b38 b39)
   deleted: (on b38 b39) (clear b38) (arm-empty)
   added: (holding b38) (clear b39)
   goals met: 8 of 11
48. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 8 of 11
49. (unstack b39 b89)
   deleted: (on b39 b89) (clear b39) (arm-empty)
   added: (holding b39) (clear b89)
   goals met: 8 of 11
50. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 8 of 11
51. (unstack b89 b59)
   deleted: (on b89 b59) (clear b89) (arm-empty)
   added: (holding b89) (clear b59)
   goals met: 8 of 11
52. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 8 of 11
53. (unstack b59 b10)
   deleted: (on b59 b10) (clear b59) (arm-empty)
   added: (holding b59) (clear b10)
   goals met: 8 of 11
54. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 8 of 11
55. (unstack b10 b29)
   deleted: (on b10 b29) (clear b10) (arm-empty)
   added: (holding b10) (clear b29)
   goals met: 8 of 11
56. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 8 of 11
57. (unstack b29 b1)
   deleted: (on b29 b1) (clear b29) (arm-empty)
   added: (holding b29) (clear b1)
   goals met: 8 of 11
58. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 8 of 11
59. (unstack b1 b53)
   deleted: (on b1 b53) (clear b1) (arm-empty)
   added: (holding b1) (clear b53)
   goals met: 8 of 11
60. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 9 of 11
61. (unstack b7 b9)
   deleted: (on b7 b9) (clear b7) (arm-empty)
   added: (holding b7) (clear b9)
   goals met: 8 of 11
62. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 11
63. (unstack b9 b64)
   deleted: (on b9 b64) (clear b9) (arm-empty)
   added: (holding b9) (clear b64)
   goals met: 8 of 11
64. (stack b9 b1)
   deleted: (clear b1) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b1)
   goals met: 9 of 11
65. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 11
66. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 10 of 11
67. (unstack b8 b4)
   deleted: (on b8 b4) (clear b8) (arm-empty)
   added: (holding b8) (clear b4)
   goals met: 8 of 11
68. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 9 of 11
69. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 9 of 11
70. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 10 of 11
71. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 11
72. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 11 of 11
